//降壓輸出的回授分壓電阻為3.3K/10K+3.3K=0.248倍......錯，舊數據
  //若v=3.4，則A0讀到3.4*0.248/1.1*1023=784.176
  //
  //因應新的(不知哪來的)1.8V參考源，
  //若v=3.4，則A0讀到3.4*0.248/1.8*1023=479.219
  //但是實驗發現，A0=880~850
  //
  //我發現：
  //儘管內置參考源為1.1V，依然受到電源電壓影響。意即，當電壓源為3.5V或4.2V時，讀到的ADC值雖然一樣，實際電壓卻會不同。
 
  //電池電源的回授分壓電阻為2.2K/10K+2.2K=0.18倍 (會用2.2K而非3.3K是為了在最大精準下不會爆錶
  //若v=3.9，則A1讀到3.9*0.18/1.1*1023=652.86
  //若v=3.5，則A1讀到3.5*0.18/1.1*1023=585.9
  //
  //怪怪，內置參考源變成1.6V
  //那麼:
  //若v=3.9，則A1讀到3.9*0.18/1.6*1023=448.84
  //若v=3.5，則A1讀到3.5*0.18/1.6*1023=408.806
  //
  //超怪，我又算出新的參考源變成1.8V
  //那麼:
  //若v=3.9，則A1讀到3.9*0.18/1.8*1023=398.97
  //若v=3.5，則A1讀到3.5*0.18/1.8*1023=358.05
  //
